; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	image5 - mode
	image2 - mode
	thermograph3 - mode
	infrared0 - mode
	thermograph1 - mode
	infrared4 - mode
	GroundStation1 - direction
	Star4 - direction
	Star8 - direction
	Star9 - direction
	GroundStation2 - direction
	Star5 - direction
	Star3 - direction
	Star0 - direction
	Star6 - direction
	GroundStation7 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star6)
	(supports instrument1 infrared4)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star14)
	(supports instrument2 thermograph3)
	(supports instrument2 image2)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph3)
	(supports instrument3 image5)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star5)
	(supports instrument4 image2)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 Star6)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
)
(:goal (and
	(pointing satellite2 Star0)
	(have_image Phenomenon10 image5)
	(have_image Star11 thermograph3)
	(have_image Star11 image2)
	(have_image Star12 image2)
	(have_image Star12 infrared4)
	(have_image Planet13 image5)
	(have_image Star14 image2)
	(have_image Star14 thermograph1)
	(have_image Phenomenon15 infrared0)
	(have_image Phenomenon15 image2)
))

)

; plan
1. (turn_to satellite2 star0 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star0)
   goals met: 1 of 11
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 1 of 11
3. (calibrate satellite2 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 1 of 11
4. (turn_to satellite2 planet13 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet13)
   goals met: 0 of 11
5. (take_image satellite2 planet13 instrument3 image5)
   added: (have_image planet13 image5)
   goals met: 1 of 11
6. (turn_to satellite2 phenomenon10 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 phenomenon10)
   goals met: 1 of 11
7. (turn_to satellite1 groundstation7 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation7)
   goals met: 1 of 11
8. (turn_to satellite0 groundstation2 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 11
9. (take_image satellite2 phenomenon10 instrument3 image5)
   added: (have_image phenomenon10 image5)
   goals met: 2 of 11
10. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 11
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 11
12. (calibrate satellite1 instrument2 groundstation7)
   added: (calibrated instrument2)
   goals met: 2 of 11
13. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 2 of 11
14. (turn_to satellite0 star12 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star12)
   goals met: 2 of 11
15. (take_image satellite0 star12 instrument1 infrared4)
   added: (have_image star12 infrared4)
   goals met: 3 of 11
16. (turn_to satellite1 phenomenon15 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 phenomenon15)
   goals met: 3 of 11
17. (take_image satellite1 phenomenon15 instrument2 image2)
   added: (have_image phenomenon15 image2)
   goals met: 4 of 11
18. (take_image satellite1 phenomenon15 instrument2 infrared0)
   added: (have_image phenomenon15 infrared0)
   goals met: 5 of 11
19. (turn_to satellite1 star11 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 star11)
   goals met: 5 of 11
20. (take_image satellite1 star11 instrument2 image2)
   added: (have_image star11 image2)
   goals met: 6 of 11
21. (take_image satellite1 star11 instrument2 thermograph3)
   added: (have_image star11 thermograph3)
   goals met: 7 of 11
22. (turn_to satellite1 star12 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star12)
   goals met: 7 of 11
23. (take_image satellite1 star12 instrument2 image2)
   added: (have_image star12 image2)
   goals met: 8 of 11
24. (turn_to satellite1 star14 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star14)
   goals met: 8 of 11
25. (take_image satellite1 star14 instrument2 image2)
   added: (have_image star14 image2)
   goals met: 9 of 11
26. (turn_to satellite2 star14 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 star14)
   goals met: 9 of 11
27. (take_image satellite2 star14 instrument3 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 10 of 11
28. (turn_to satellite2 star0 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star0)
   goals met: 11 of 11
